# Arithmetic Operations

In [1]:
import pandas as pd

In [2]:
df_1 = pd.DataFrame({
    "A": [1,2,3,4],
    "B":[1,2,3,4]
})

df_1

   A  B
0  1  1
1  2  2
2  3  3
3  4  4

In [3]:
df_1["A"]

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [4]:
df_1["C"] = df_1["A"] + df_1["B"] # add new column C, values is sum of column a and b
df_1

   A  B  C
0  1  1  2
1  2  2  4
2  3  3  6
3  4  4  8

In [5]:
df_1["D"] = df_1["C"] - df_1["A"] # add new column C, values is subtract of column a and b
df_1

   A  B  C  D
0  1  1  2  1
1  2  2  4  2
2  3  3  6  3
3  4  4  8  4

In [6]:
df_1["E"] = df_1["A"] * df_1["B"] # add new column C, values is multify of column a and b
df_1

   A  B  C  D   E
0  1  1  2  1   1
1  2  2  4  2   4
2  3  3  6  3   9
3  4  4  8  4  16

In [7]:
df_1["F"] = df_1["C"] / df_1["A"] # add new column C, values is divide of column a and b
df_1

   A  B  C  D   E    F
0  1  1  2  1   1  2.0
1  2  2  4  2   4  2.0
2  3  3  6  3   9  2.0
3  4  4  8  4  16  2.0

In [8]:
df_2 = pd.DataFrame({
    "A": [10, 20, 30, 40],
    "B":[8, 25, 29, 47]
})

df_2

    A   B
0  10   8
1  20  25
2  30  29
3  40  47

In [9]:
df_2["compare"] = df_2["A"] <= df_2["B"] # can compare with any number
df_2

    A   B  compare
0  10   8    False
1  20  25     True
2  30  29    False
3  40  47     True